<template>
  <div class="container">
    <div class="shadow p-3">
      <MainPassportCountryContentImg
        text="Маҷалла бо забонҳои тоҷикӣ, русӣ ва англисӣ нашр мешавад.
            Маҷалла дар Вазорати фарҳанги Ҷумҳурии Тоҷикистон таҳти №242/МҶ– 97 аз 12.04.2022 сабти ном шудааст.
            Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон, 2022
            Паёми молия ва иқтисод
            Маҷалла ба Феҳристи тақризшавандаи маҷаллаҳои илмии КОА-и назди Президенти Ҷумҳурии Тоҷикистон шомил буда, дар он натиҷаҳои асосии илмии рисолаҳо барои дарёфти дараҷаи илмии доктор ва номзади илм чоп мешаванд.
            Маҷалла шомили пойгоҳи иттилоотии Намояи иқтибосоварии илмии Россия (НИИР) шудааст."
        imgSmall="_nuxt/assets/main/passport_country-min.jpg"
        imgBig="_nuxt/assets/main/passport_country.jpg"
      />
    </div>
  </div>
</template>

<script setup>
useHead({
  title: "Шаҳодатномаи қайди давлатӣ",
});
</script>

<style lang="scss" scoped></style>
