<script setup>
import { editingCategoryStore } from "~/store/EditingPerson";
const listData = editingCategoryStore();
useHead({
  title: "Ҳайати таҳририя",
});
onMounted(() => {
  listData.index();
});
definePageMeta({
  middleware: "has-user",
});
// const dataPositionList = ref([
//   {
//     title: "Сармуҳаррир",
//     list: [
//       {
//         person: "Абдуалимзода Ҳ.А",
//         personInfo:
//           " – сармуҳаррир, номзади илмҳои иқтисодӣ, дотсент, ректори Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//     ],
//   },
//   {
//     title: "Муовинони сармуҳаррир",
//     list: [
//       {
//         person: "Қодиров Ф.А.",
//         personInfo:
//           " – муовини сармуҳаррир, номзади илмҳои иқтисодӣ, дотсент, муовини ректор оид ба илми Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//       {
//         person: "Саидмуродов Л.Ҳ.",
//         personInfo:
//           " – муовини сармуҳаррир, узви вобастаи АМИТ, доктори илмҳои иқтисодӣ, профессори кафедраи муносибатҳои молиявӣ-қарзии байналхалқии Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//     ],
//   },
//   {
//     title: "Аъзои ҳайати таҳририя:",
//     list: [
//       {
//         person: "Хайрзода Ш.Қ.",
//         personInfo:
//           "– доктори илмҳои иқтисодӣ, муовини вазири маориф ва илми Ҷумҳурии Тоҷикистон",
//       },
//       {
//         person: "Раҳимзода Ш.",
//         personInfo:
//           "– доктори илмҳои иқтисодӣ, профессори кафедраи фаъолияти бонкии Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон, директори Институти иқтисодиёт ва демографияи АМИТ",
//       },
//       {
//         person: "Эргашев Р.Х.",
//         personInfo:
//           "– доктори илмҳои иқтисодӣ, профессори кафедраи иқтисодиёти Донишкадаи муҳандисию иқтисодии Қаршии Ҷумҳурии Ӯзбекистон",
//       },
//       {
//         person: "Фақеров Ҳ.Н.",
//         personInfo:
//           "– доктори илмҳои иқтисодӣ, профессори кафедраи иқтисоди корхонаҳо ва соҳибкории Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//       {
//         person: "Шарифов З.Р.",
//         personInfo:
//           "– доктори илмҳои иқтисодӣ, профессор, кафедраи баҳисобгирии муҳосибӣ ва аудити Донишгоҳи аграрии Тоҷикистон ба номи Шириншоҳ Шотемур",
//       },
//       {
//         person: "Шарипов Б.М",
//         personInfo:
//           "– доктори илмҳои иқтисодӣ, профессори кафедраи фаъолияти бонкии Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//       {
//         person: "Ҷонмамадов Ш.Б",
//         personInfo:
//           " – доктори илмҳои иқтисодӣ, профессори кафедраи иқтисодиёти ҷаҳон ва тиҷорати байналмилалии Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//       {
//         person: "Хоҷаев П",
//         personInfo:
//           " – доктори илмҳои иқтисодӣ, профессори кафедраи назарияи иқтисодии Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//       {
//         person: "Қандиёрова Д.О.",
//         personInfo:
//           " – доктори илмҳои иқтисодӣ, профессори кафедраи назарияи иқтисодии Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//       {
//         person: "Кошонова М.Р.",
//         personInfo:
//           "– доктори илмҳои иқтисодӣ, профессори кафедраи молияи Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//       {
//         person: "Мирсаидов С.А",
//         personInfo:
//           "– доктори илмҳои иқтисодӣ, профессори кафедраи менеҷменти Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//       {
//         person: "Бегматов А.А",
//         personInfo:
//           "– номзади илмҳои иқтисодӣ, профессори кафедраи молияи Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//       {
//         person: "Насриддинов Ф.Б.",
//         personInfo:
//           "– номзади илмҳои иқтисодӣ, профессори кафедраи назарияи иқтисодии Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//       {
//         person: "Сафаров Б.Г.",
//         personInfo:
//           " – номзади илмҳои иқтисодӣ, дотсент, муовини ректор оид ба робитаҳои байналмилалии Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//       {
//         person: "Маъдиев С",
//         personInfo:
//           "– номзади илмҳои иқтисодӣ, мудири кафедраи баҳисобгирии муҳосибии Донишгоҳи давлатии молия ва иқтисоди Тоҷикистон",
//       },
//     ],
//   },
// ]);
</script>

<template>
  <div class="p-5">
    <MainEditorialBoardPositionsList
      v-for="item in listData.category"
      :title="item.category"
      :list="item.persons"
      :key="item.id"
    />
  </div>
</template>
